app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.all
---
SELECT "blogs".* FROM "blogs"  ORDER BY "blogs"."updated_at" DESC

  def show
    @comment = @blog.comments.build
    @comments = @blog.comments
    #Notification.find(params[:notification_id]).update(read: true) if params[:notification_id]
    if params[:notification_id]
      notifications = Notification.where(comment: @comments)
---
SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = $1  [["blog_id", 4]]

  def create
    @blog = Blog.new(blogs_params)
    @blog.user_id = current_user.id
    if @blog.save
---
INSERT INTO "blogs" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "こんにちは"], ["content", "いいお天気ですね"], ["user_id", 5], ["created_at", "2017-05-07 10:54:18.663204"], ["updated_at", "2017-05-07 10:54:18.663204"]]

   def set_blog
     @blog = Blog.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1  ORDER BY "blogs"."updated_at" DESC LIMIT 1  [["id", 5]]