app/controllers/comments_controller.rb

INSERT INTO "comments" ("blog_id", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["blog_id", 4], ["content", "ooo"], ["user_id", 2], ["created_at", "2017-05-13 05:06:26.419934"], ["updated_at", "2017-05-13 05:06:26.419934"]]
---
  def create
    @comment = current_user.comments.build(comment_params)
    @blog = @comment.blog
    @comments = @blog.comments
    respond_to do |format|
      if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 14]]
UPDATE "comments" SET "blog_id" = $1, "content" = $2, "updated_at" = $3 WHERE "comments"."id" = $4  [["blog_id", nil], ["content", "iii"], ["updated_at", "2017-05-15 07:02:46.246915"], ["id", 37]]
---
  def update
    @comment = Comment.find(params[:id])
    @blog = @comment.blog
    @comments = @blog.comments
    respond_to do |format|
      if @comment.update(comment_params)

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]
---
  def destroy
    @comment = Comment.find(params[:id])
    @blog = @comment.blog
    @comments = @blog.comments
    respond_to do |format|
      if @comment.destroy